/* 
  Registration.strings
  LKMailFramework

  Created by Scott Little on 09/09/2011.
  Copyright 2011 Little Known Software. All rights reserved.
*/

//	Registration Strings
"The demo of SignatureProfiler that you have installed has expired.

To continue using it you will need to purchase a license." = "The demo of SignatureProfiler that you have installed has expired.

To continue using it you will need to purchase a license.";
"Purchase License" = "Purchase License";

//		"Message to show at the bottom of the purchase window, showing the activity"
"Loading Store Page..." = "Loading Store Page...";

"expire-past" = "expired";
"expire-future" = "expires";
"Invalid Registration Data" = "**Invalid Registration Data**";
"This demo %@ on %@" = "This demo %@ on %@";
"Please purchase a valid license." = "Please Purchase a Valid License.";

//	
"Cancel" = "Cancel";
"Close" = "Close";


//	Error Handling display messages
//		Error message when activation fails because there is no file available
"Hmm. The license retreived seems invalid." = "Hmm. The license retreived seems invalid.";
//		Help message when activation fails because of a serious backend issue
"This is our fault and we should have already been alerted to the issue, however if you click 'Send Email' an email describing the issue will be prepared for you to send." = "This is our fault and we should have already been alerted to the issue, however if you click 'Send Email' an email describing the issue will be prepared for you to send.";
//		"Error message when activation fails because there is no file available
"We have an issue with your order." = "We have an issue with your order.";
//		"Help message when activation fails because of a serious backend issue"
"We should have already been alerted to the issue, however if you click 'Send Email' an email describing the issue will be prepared for you to send." = "We should have already been alerted to the issue, however if you click 'Send Email' an email describing the issue will be prepared for you to send.";
//		"Error message when activation fails because of a product mismatch"
"This activation information is for a different product." = "This activation information is for a different product.";
//	"Help message when activation fails because of a product mismatch"
"The info provided is for '%@'. Please ensure that the Name and Activation Code for '%@' are exactly as presented in your email message." = "The info provided is for '%@'. Please ensure that the Name and Activation Code for '%@' are exactly as presented in your email message.";
//		"Error message when activation fails because user entered invalid values"
"I couldn't find a license for those values." = "I couldn't find a license for those values.";
//		"Help message when activation fails because user entered invalid values"
"Please ensure that the Name and Activation Code are exactly as presented in your email message." = "Please ensure that the Name and Activation Code are exactly as presented in your email message.";
//		"Error message when activation fails because of bad values sent"
"Looks like I have a bug." = "Looks like I have a bug.";
//		"Help message when activation fails because of bad values sent"
"Please send us an email to get this resolved. Click then 'Send Email' button below to open a message describing the issue." = "Please send us an email to get this resolved. Click the 'Send Email' button below to open a message describing the issue.";
//		"Button text in alert to send us an email describing a problem"
"Send Email" = "Send Email";
//		"Funny button text in alert that just closes the dialog"
"Nevermind!" = "Nevermind!";
//		"Button text to just close error dialog and let the user retry."
"Try Again" = "Try Again";

